# Lists

In [1]:
import numpy as np
import pandas as pd
import re

In [2]:
x = np.arange(1200, 2001)

### Q1:

In [3]:
np.sum(x)

1281600

### Q2:

In [4]:
np.max(x)

2000

### Q3:

In [5]:
x[x % 2 == 0]

array([1200, 1202, 1204, 1206, 1208, 1210, 1212, 1214, 1216, 1218, 1220,
       1222, 1224, 1226, 1228, 1230, 1232, 1234, 1236, 1238, 1240, 1242,
       1244, 1246, 1248, 1250, 1252, 1254, 1256, 1258, 1260, 1262, 1264,
       1266, 1268, 1270, 1272, 1274, 1276, 1278, 1280, 1282, 1284, 1286,
       1288, 1290, 1292, 1294, 1296, 1298, 1300, 1302, 1304, 1306, 1308,
       1310, 1312, 1314, 1316, 1318, 1320, 1322, 1324, 1326, 1328, 1330,
       1332, 1334, 1336, 1338, 1340, 1342, 1344, 1346, 1348, 1350, 1352,
       1354, 1356, 1358, 1360, 1362, 1364, 1366, 1368, 1370, 1372, 1374,
       1376, 1378, 1380, 1382, 1384, 1386, 1388, 1390, 1392, 1394, 1396,
       1398, 1400, 1402, 1404, 1406, 1408, 1410, 1412, 1414, 1416, 1418,
       1420, 1422, 1424, 1426, 1428, 1430, 1432, 1434, 1436, 1438, 1440,
       1442, 1444, 1446, 1448, 1450, 1452, 1454, 1456, 1458, 1460, 1462,
       1464, 1466, 1468, 1470, 1472, 1474, 1476, 1478, 1480, 1482, 1484,
       1486, 1488, 1490, 1492, 1494, 1496, 1498, 1500, 1502, 1504, 1506,
       1508, 1510, 1512, 1514, 1516, 1518, 1520, 1522, 1524, 1526, 1528,
       1530, 1532, 1534, 1536, 1538, 1540, 1542, 1544, 1546, 1548, 1550,
       1552, 1554, 1556, 1558, 1560, 1562, 1564, 1566, 1568, 1570, 1572,
       1574, 1576, 1578, 1580, 1582, 1584, 1586, 1588, 1590, 1592, 1594,
       1596, 1598, 1600, 1602, 1604, 1606, 1608, 1610, 1612, 1614, 1616,
       1618, 1620, 1622, 1624, 1626, 1628, 1630, 1632, 1634, 1636, 1638,
       1640, 1642, 1644, 1646, 1648, 1650, 1652, 1654, 1656, 1658, 1660,
       1662, 1664, 1666, 1668, 1670, 1672, 1674, 1676, 1678, 1680, 1682,
       1684, 1686, 1688, 1690, 1692, 1694, 1696, 1698, 1700, 1702, 1704,
       1706, 1708, 1710, 1712, 1714, 1716, 1718, 1720, 1722, 1724, 1726,
       1728, 1730, 1732, 1734, 1736, 1738, 1740, 1742, 1744, 1746, 1748,
       1750, 1752, 1754, 1756, 1758, 1760, 1762, 1764, 1766, 1768, 1770,
       1772, 1774, 1776, 1778, 1780, 1782, 1784, 1786, 1788, 1790, 1792,
       1794, 1796, 1798, 1800, 1802, 1804, 1806, 1808, 1810, 1812, 1814,
       1816, 1818, 1820, 1822, 1824, 1826, 1828, 1830, 1832, 1834, 1836,
       1838, 1840, 1842, 1844, 1846, 1848, 1850, 1852, 1854, 1856, 1858,
       1860, 1862, 1864, 1866, 1868, 1870, 1872, 1874, 1876, 1878, 1880,
       1882, 1884, 1886, 1888, 1890, 1892, 1894, 1896, 1898, 1900, 1902,
       1904, 1906, 1908, 1910, 1912, 1914, 1916, 1918, 1920, 1922, 1924,
       1926, 1928, 1930, 1932, 1934, 1936, 1938, 1940, 1942, 1944, 1946,
       1948, 1950, 1952, 1954, 1956, 1958, 1960, 1962, 1964, 1966, 1968,
       1970, 1972, 1974, 1976, 1978, 1980, 1982, 1984, 1986, 1988, 1990,
       1992, 1994, 1996, 1998, 2000])

### Q4:

In [6]:
x[:5]

array([1200, 1201, 1202, 1203, 1204])

# Dictionaries

In [7]:
df = pd.DataFrame(data = { "Name": ["Amal", "Mohammed", "Khadijah", "Abdullah", "Rawan", "Faisal", "Layla", "Saleh"],
                         "Number": ["+966 54 151 1811", "055 151 1231", "+966 55 151 1221", "055 151 1121", "055 151 1200", "055 151 1299", "055 151 1288", "+966 55 982 3892"]})

In [8]:
df

       Name            Number
0      Amal  +966 54 151 1811
1  Mohammed      055 151 1231
2  Khadijah  +966 55 151 1221
3  Abdullah      055 151 1121
4     Rawan      055 151 1200
5    Faisal      055 151 1299
6     Layla      055 151 1288
7     Saleh  +966 55 982 3892

In [9]:
def country_key(num):
    if num.startswith('+966'):
        return "+966"
    else:
        return np.NaN
    
df["CountryKey"] = df["Number"].apply(country_key)
df["Number"].replace(["\+966", "0(?=5)", "\s"], "", regex = True, inplace = True)

In [10]:
df

       Name     Number CountryKey
0      Amal  541511811       +966
1  Mohammed  551511231        NaN
2  Khadijah  551511221       +966
3  Abdullah  551511121        NaN
4     Rawan  551511200        NaN
5    Faisal  551511299        NaN
6     Layla  551511288        NaN
7     Saleh  559823892       +966

In [11]:
number = "559823892"    
number = re.sub(r"\+\d{3}|0(?=5)", "", number)
number

'559823892'

In [12]:
def findNum(num):
    return df.loc[(df["Number"] == num)]
        
findNum(number)["Name"].to_string(index = False)

'Saleh'